WeightLossDiary/src/Documents/Питание/Питание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Питание</name>
  <registerRecords>AccumulationRegister.Калории</registerRecords>
  <attributes>
    <name>ВремяДня</name>
    <type>
      <types>EnumRef.ВремяДня</types>
    </type>
  </attributes>
  <attributes>
    <name>Калории</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаПитания</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Продукты</types>
      </type>
    </attributes>
    <attributes>
      <name>КалорийностьПродукта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Масса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКалорий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

WeightLossDiary/src/AccumulationRegisters/Калории/Калории.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Калории</name>
  <resources>
    <name>КоличествоКалорий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Продукт</name>
    <type>
      <types>CatalogRef.Продукты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяДня</name>
    <type>
      <types>EnumRef.ВремяДня</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

WeightLossDiary/src/Documents/Питание/ObjectModule.bsl
#Область  ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПитаниеТаблицаПитания.Продукт КАК Продукт,
		|	СУММА(ПитаниеТаблицаПитания.КоличествоКалорий) КАК КоличествоКалорий,
		|	ПитаниеТаблицаПитания.Ссылка.Дата КАК Период,
		|	ПитаниеТаблицаПитания.Ссылка.ВремяДня КАК ВремяДня
		|ИЗ
		|	Документ.Питание.ТаблицаПитания КАК ПитаниеТаблицаПитания
		|ГДЕ
		|	ПитаниеТаблицаПитания.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПитаниеТаблицаПитания.Продукт,
		|	ПитаниеТаблицаПитания.Ссылка.Дата,
		|	ПитаниеТаблицаПитания.Ссылка.ВремяДня";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Движения.Калории.Записывать = Истина;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.Калории.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
			
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Калории = ТаблицаПитания.Итог("КоличествоКалорий");
		
КонецПроцедуры


#КонецОбласти
